<h1>Tabla de contenidos<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Data-aggregation" data-toc-modified-id="Data-aggregation-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Data aggregation</a></span><ul class="toc-item"><li><span><a href="#groupby" data-toc-modified-id="groupby-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>groupby</a></span><ul class="toc-item"><li><span><a href="#groupby-&amp;-aggregate" data-toc-modified-id="groupby-&amp;-aggregate-1.1.1"><span class="toc-item-num">1.1.1&nbsp;&nbsp;</span>groupby &amp; aggregate</a></span></li></ul></li><li><span><a href="#Pivot-Tables" data-toc-modified-id="Pivot-Tables-1.2"><span class="toc-item-num">1.2&nbsp;&nbsp;</span>Pivot Tables</a></span></li><li><span><a href="#Differences-between-pivot-table-and-groupby-function" data-toc-modified-id="Differences-between-pivot-table-and-groupby-function-1.3"><span class="toc-item-num">1.3&nbsp;&nbsp;</span>Differences between pivot table and groupby function</a></span></li><li><span><a href="#crosstab" data-toc-modified-id="crosstab-1.4"><span class="toc-item-num">1.4&nbsp;&nbsp;</span>crosstab</a></span></li></ul></li><li><span><a href="#Data-combination:-mixing-dataframes" data-toc-modified-id="Data-combination:-mixing-dataframes-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Data combination: mixing dataframes</a></span><ul class="toc-item"><li><span><a href="#Concat:-two-things-together" data-toc-modified-id="Concat:-two-things-together-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Concat: two things together</a></span><ul class="toc-item"><li><span><a href="#Concatenating-on-axis-0-(rows)" data-toc-modified-id="Concatenating-on-axis-0-(rows)-2.1.1"><span class="toc-item-num">2.1.1&nbsp;&nbsp;</span>Concatenating on axis 0 (rows)</a></span></li><li><span><a href="#Concatenating-on-axis-1-(columns)" data-toc-modified-id="Concatenating-on-axis-1-(columns)-2.1.2"><span class="toc-item-num">2.1.2&nbsp;&nbsp;</span>Concatenating on axis 1 (columns)</a></span></li></ul></li><li><span><a href="#Merge:-related-columns" data-toc-modified-id="Merge:-related-columns-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>Merge: related columns</a></span><ul class="toc-item"><li><span><a href="#LEFT-Merge" data-toc-modified-id="LEFT-Merge-2.2.1"><span class="toc-item-num">2.2.1&nbsp;&nbsp;</span>LEFT Merge</a></span></li><li><span><a href="#RIGHT-Merge" data-toc-modified-id="RIGHT-Merge-2.2.2"><span class="toc-item-num">2.2.2&nbsp;&nbsp;</span>RIGHT Merge</a></span></li><li><span><a href="#INNER-Merge" data-toc-modified-id="INNER-Merge-2.2.3"><span class="toc-item-num">2.2.3&nbsp;&nbsp;</span>INNER Merge</a></span></li><li><span><a href="#OUTER-Merge" data-toc-modified-id="OUTER-Merge-2.2.4"><span class="toc-item-num">2.2.4&nbsp;&nbsp;</span>OUTER Merge</a></span></li></ul></li><li><span><a href="#Merging-&amp;-Concatenating-in-two-different-columns" data-toc-modified-id="Merging-&amp;-Concatenating-in-two-different-columns-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>Merging &amp; Concatenating in two different columns</a></span><ul class="toc-item"><li><span><a href="#Concatenating-in-two-different-columns" data-toc-modified-id="Concatenating-in-two-different-columns-2.3.1"><span class="toc-item-num">2.3.1&nbsp;&nbsp;</span>Concatenating in two different columns</a></span></li><li><span><a href="#Merging-in-two-different-columns" data-toc-modified-id="Merging-in-two-different-columns-2.3.2"><span class="toc-item-num">2.3.2&nbsp;&nbsp;</span>Merging in two different columns</a></span></li></ul></li><li><span><a href="#Join:-relating-index" data-toc-modified-id="Join:-relating-index-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span>Join: relating index</a></span></li><li><span><a href="#Differences-between-join-&amp;-merge" data-toc-modified-id="Differences-between-join-&amp;-merge-2.5"><span class="toc-item-num">2.5&nbsp;&nbsp;</span>Differences between join &amp; merge</a></span></li></ul></li><li><span><a href="#Pandas-usual-methods" data-toc-modified-id="Pandas-usual-methods-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Pandas usual methods</a></span></li><li><span><a href="#Further-materials" data-toc-modified-id="Further-materials-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Further materials</a></span></li></ul></div>

![](https://miro.medium.com/max/1400/1*6d5dw6dPhy4vBp2vRW6uzw.webp)

Primero, importamos las librer√≠as principales:

In [5]:
import pandas as pd
import numpy as np

Cargamos un nuevo dataset.

In [7]:
df = pd.read_csv("./datasets/employees.csv")

what is it about? Let's look at it all together:

In [9]:
df

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1465,36,No,Travel_Frequently,884,Research & Development,23,2,Medical,1,2061,...,3,80,1,17,3,3,5,2,0,3
1466,39,No,Travel_Rarely,613,Research & Development,6,1,Medical,1,2062,...,1,80,1,9,5,3,7,7,1,7
1467,27,No,Travel_Rarely,155,Research & Development,4,3,Life Sciences,1,2064,...,2,80,1,6,0,3,6,2,0,3
1468,49,No,Travel_Frequently,1023,Sales,2,3,Medical,1,2065,...,4,80,0,17,3,2,9,6,0,8
1469,34,No,Travel_Rarely,628,Research & Development,8,3,Medical,1,2068,...,1,80,0,6,3,4,4,3,1,2

## Data aggregation

La agregaci√≥n de datos es una t√©cnica fundamental en el an√°lisis de datos que implica agrupar y resumir datos para obtener informaci√≥n y tomar decisiones informadas. En esta secci√≥n, exploraremos m√©todos esenciales de Pandas para la agregaci√≥n de datos, incluyendo `groupby`, `pivot_table` y `crosstab`.

Estas t√©cnicas son particularmente √∫tiles cuando se trata de grandes conjuntos de datos o cuando necesitas resumir datos a trav√©s de diferentes categor√≠as o dimensiones. Ya sea que quieras calcular estad√≠sticas para grupos espec√≠ficos, crear tablas resumen o analizar relaciones entre variables, los m√©todos de agregaci√≥n de datos en Pandas proporcionan las herramientas para agilizar tu an√°lisis.

Vamos a sumergirnos en cada uno de estos m√©todos y descubrir c√≥mo pueden ayudarte a descubrir patrones y tendencias significativas dentro de tus datos.

### groupby

Pandas GroupBy es una funci√≥n poderosa y vers√°til en Python que es indispensable para la manipulaci√≥n y an√°lisis de datos. Nos permite dividir un DataFrame en grupos separados basados en uno o m√°s criterios y realizar varios c√°lculos sobre estos grupos para un an√°lisis profundo.

El concepto es sencillo: seleccionas un DataFrame, especificas las categor√≠as o criterios por los cuales quieres agrupar tus datos, y luego aplicas funciones de agregaci√≥n a cada grupo. Estas funciones de agregaci√≥n pueden incluir c√°lculos como sumar, promediar, contar, o incluso funciones definidas por el usuario, dependiendo de tus objetivos de an√°lisis.

Las operaciones de GroupBy son invaluables para tareas como resumir datos, explorar patrones dentro de grupos espec√≠ficos, o comparar diferentes segmentos de tu conjunto de datos. Ya est√©s trabajando con datos de ventas, comportamiento del cliente, o cualquier otro tipo de datos estructurados, Pandas GroupBy es tu herramienta de elecci√≥n.

Aqu√≠ tienes una sintaxis b√°sica para usar GroupBy:

`df[subset].groupby(category).aggregation()`

Para profundizar en las capacidades y opciones de Pandas GroupBy, puedes referirte a la documentaci√≥n oficial [aqu√≠](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.groupby.html).

`groupby the departments and their mean age`

In [12]:
df[["Age", "Department"]]

      Age              Department
0      41                   Sales
1      49  Research & Development
2      37  Research & Development
3      33  Research & Development
4      27  Research & Development
...   ...                     ...
1465   36  Research & Development
1466   39  Research & Development
1467   27  Research & Development
1468   49                   Sales
1469   34  Research & Development

[1470 rows x 2 columns]

In [13]:
# Hay dos formas de hacerlo (1st)
df[["Age", "Department"]].groupby("Department").mean()

                              Age
Department
Human Resources         37.809524
Research & Development  37.042664
Sales                   36.542601

In [14]:
# Hay dos formas de hacerlo (2nd)
df[["Age", "Department"]].groupby("Department").agg("mean")

                              Age
Department
Human Resources         37.809524
Research & Development  37.042664
Sales                   36.542601

`groupby the departments and their maximum age`

In [16]:
# Hay dos formas de hacerlo (1st)
df[["Age", "Department"]].groupby("Department").agg({"Age":"max"})

                        Age
Department
Human Resources          59
Research & Development   60
Sales                    60

In [17]:
# Hay dos formas de hacerlo (2nd)
df[["Age", "Department"]].groupby("Department").max()

                        Age
Department
Human Resources          59
Research & Development   60
Sales                    60

`groupby the departments and their min age`

In [19]:
# Hay dos formas de hacerlo  (1st)
df[["Age", "Department"]].groupby("Department").agg({"Age":"min"})

                        Age
Department
Human Resources          19
Research & Development   18
Sales                    18

In [20]:
# Hay dos formas de hacerlo  (2nd)
df[["Age", "Department"]].groupby("Department").min()

                        Age
Department
Human Resources          19
Research & Development   18
Sales                    18

`groupby: 2+`: Diferentes campos de educaci√≥n y sus salarios medios en cada uno de los departamentos

In [22]:
df[["EducationField", "HourlyRate", "Department"]].groupby(by=["Department", "EducationField"]).agg({"HourlyRate":"mean"})

                                         HourlyRate
Department             EducationField
Human Resources        Human Resources    60.888889
                       Life Sciences      61.625000
                       Medical            72.076923
                       Other              76.000000
                       Technical Degree   64.000000
Research & Development Life Sciences      66.570455
                       Medical            66.330579
                       Other              62.203125
                       Technical Degree   66.351064
Sales                  Life Sciences      68.153333
                       Marketing          66.150943
                       Medical            59.943182
                       Other              60.333333
                       Technical Degree   67.676471

In [23]:
df[["EducationField", "HourlyRate", "Department"]].groupby(by=["EducationField", "Department"]).agg({"HourlyRate":"mean"})

                                         HourlyRate
EducationField   Department
Human Resources  Human Resources          60.888889
Life Sciences    Human Resources          61.625000
                 Research & Development   66.570455
                 Sales                    68.153333
Marketing        Sales                    66.150943
Medical          Human Resources          72.076923
                 Research & Development   66.330579
                 Sales                    59.943182
Other            Human Resources          76.000000
                 Research & Development   62.203125
                 Sales                    60.333333
Technical Degree Human Resources          64.000000
                 Research & Development   66.351064
                 Sales                    67.676471

`more fields`

In [25]:
df[["EducationField", "HourlyRate", "Department", "StandardHours", "Age"]].groupby(by=["Department", "EducationField"]).mean()

                                         HourlyRate  StandardHours        Age
Department             EducationField
Human Resources        Human Resources    60.888889           80.0  37.037037
                       Life Sciences      61.625000           80.0  39.375000
                       Medical            72.076923           80.0  39.846154
                       Other              76.000000           80.0  34.666667
                       Technical Degree   64.000000           80.0  32.500000
Research & Development Life Sciences      66.570455           80.0  36.997727
                       Medical            66.330579           80.0  37.242424
                       Other              62.203125           80.0  36.187500
                       Technical Degree   66.351064           80.0  37.063830
Sales                  Life Sciences      68.153333           80.0  37.186667
                       Marketing          66.150943           80.0  37.924528
                       Medical            59.943182           80.0  34.727273
                       Other              60.333333           80.0  32.000000
                       Technical Degree   67.676471           80.0  33.941176

#### groupby & aggregate

En Pandas, la funci√≥n "agg" se utiliza para agregar datos dentro de los grupos creados mediante GroupBy. Permite aplicar m√∫ltiples funciones de agregaci√≥n a la vez, ofreciendo un control detallado sobre el resumen de tus datos.

Estas son algunas funciones de agregaci√≥n comunes disponibles con "agg":
- **mean**: Calcula el promedio de los valores en cada grupo.
- **sum**: Suma todos los valores en cada grupo.
- **count**: Cuenta el n√∫mero de filas en cada grupo.

Con "agg", puedes especificar estas y otras funciones de agregaci√≥n, adaptando el resumen de tus datos a tus necesidades espec√≠ficas de an√°lisis. Esta capacidad es muy √∫til cuando necesitas obtener distintas estad√≠sticas de tus datos agrupados al mismo tiempo.

Para m√°s detalles sobre la funci√≥n "agg" y sus opciones avanzadas, puedes consultar la documentaci√≥n oficial de Pandas [aqu√≠](https://pandas.pydata.org/docs/reference/api/pandas.core.groupby.DataFrameGroupBy.aggregate.html).

### Tablas din√°micas

Las tablas din√°micas son esenciales en an√°lisis de datos, especialmente cuando necesitas analizar y comparar varios aspectos de tu conjunto de datos de manera simult√°nea. Pandas ofrece la funci√≥n `pivot_table`, que permite crear tablas din√°micas estilo hoja de c√°lculo dentro de un DataFrame.

La funci√≥n `pivot_table` acepta varios par√°metros clave:
- `df`: El DataFrame que deseas pivotar.
- `values`: Las columnas que contienen los valores para agregar.
- `index`: Las columnas que se convertir√°n en el nuevo √≠ndice de la tabla din√°mica.
- `columns`: Las columnas que se convertir√°n en las nuevas columnas de la tabla din√°mica.
- `aggfunc`: La funci√≥n de agregaci√≥n que se aplicar√° a los valores (el valor por defecto es 'mean').

Al aplicar `pivot_table`, tu data se organiza en un formato m√°s estructurado, facilitando operaciones de agregaci√≥n como el c√°lculo de medias, sumas o conteos a trav√©s de diferentes grupos y dimensiones.

Para una gu√≠a detallada sobre cu√°ndo usar `groupby` en comparaci√≥n con `pivot_table`, puedes revisar el siguiente art√≠culo: [GroupBy vs. Pivot Table](https://towardsdatascience.com/a-comparison-of-groupby-and-pivot-in-pythons-pandas-module-527909e78d6b).

Aprovechar las tablas din√°micas puede mejorar significativamente tu an√°lisis de datos, ayud√°ndote a descubrir insights en conjuntos de datos complejos.

Para conocer m√°s sobre `pivot_table` y sus opciones avanzadas, consulta la documentaci√≥n oficial de Pandas [aqu√≠](https://pandas.pydata.org/docs/reference/api/pandas.pivot_table.html).

`tabla din√°mica`: el departamento y sus edades medias

In [28]:
df.head()

,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,EmployeeCount,EmployeeNumber,...,RelationshipSatisfaction,StandardHours,StockOptionLevel,TotalWorkingYears,TrainingTimesLastYear,WorkLifeBalance,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YearsWithCurrManager
0,41,Yes,Travel_Rarely,1102,Sales,1,2,Life Sciences,1,1,...,1,80,0,8,0,1,6,4,0,5
1,49,No,Travel_Frequently,279,Research & Development,8,1,Life Sciences,1,2,...,4,80,1,10,3,3,10,7,1,7
2,37,Yes,Travel_Rarely,1373,Research & Development,2,2,Other,1,4,...,2,80,0,7,3,3,0,0,0,0
3,33,No,Travel_Frequently,1392,Research & Development,3,4,Life Sciences,1,5,...,3,80,0,8,3,3,8,7,3,0
4,27,No,Travel_Rarely,591,Research & Development,2,1,Medical,1,7,...,4,80,1,6,3,3,2,2,2,2

In [29]:
# Ejemplo, calculando media de edad por departamento
df.pivot_table(
    values = "Age",
    index = "Department",
    aggfunc = "mean"
)

                              Age
Department
Human Resources         37.809524
Research & Development  37.042664
Sales                   36.542601

Now, is your **turn**:

`pivot table`: el departamento y sus edades max

In [32]:
df.pivot_table(
    values = "Age",
    index = "Department",
    aggfunc = "max"
)

                        Age
Department
Human Resources          59
Research & Development   60
Sales                    60

`pivot table`: el departamento y sus edades min

In [34]:
df.pivot_table(
    values = "Age",
    index = "Department",
    aggfunc = "min"
)

                        Age
Department
Human Resources          19
Research & Development   18
Sales                    18

`pivot table`: el departamento y media de edad

In [36]:
df.pivot_table(
    values = "Age",
    index = "Department",
    aggfunc = "median",
    columns= "EducationField"
)

EducationField,Human Resources,Life Sciences,Marketing,Medical,Other,Technical Degree
Department,,,,,,
Human Resources,36.0,41.0,NaN,42.0,37.0,34.5
Research & Development,NaN,36.0,NaN,36.0,35.5,35.5
Sales,NaN,36.0,36.0,34.0,31.0,33.0

`multi-index pivot table`: salario m√°ximo de los empleados por departamento y campo de educaci√≥n.

In [38]:
# Example, calculating mean age by department and EducationField

df.pivot_table (
    values = "Age",
    index = ["Department", "EducationField"],
    aggfunc = "mean"
)

                                               Age
Department             EducationField
Human Resources        Human Resources   37.037037
                       Life Sciences     39.375000
                       Medical           39.846154
                       Other             34.666667
                       Technical Degree  32.500000
Research & Development Life Sciences     36.997727
                       Medical           37.242424
                       Other             36.187500
                       Technical Degree  37.063830
Sales                  Life Sciences     37.186667
                       Marketing         37.924528
                       Medical           34.727273
                       Other             32.000000
                       Technical Degree  33.941176

### crosstab

En el an√°lisis de datos, comprender las relaciones entre variables categ√≥ricas es a menudo crucial para obtener insights sobre tu conjunto de datos. Pandas ofrece una herramienta llamada `crosstab` que te ayuda a computar una simple tabulaci√≥n cruzada de dos o m√°s factores dentro de tu DataFrame.

La funci√≥n `pd.crosstab()` est√° dise√±ada para este prop√≥sito y es particularmente √∫til cuando quieres examinar la frecuencia o distribuci√≥n de una variable categ√≥rica en relaci√≥n con otra. Por defecto, computa una tabla de frecuencia, pero tambi√©n puedes pasar un arreglo de valores y una funci√≥n de agregaci√≥n para an√°lisis m√°s avanzados.

Sintaxys basica:
```python
pd.crosstab(df[column1], df[column2])
```

In [40]:
# Example I
pd.crosstab(df["Department"],  [df["BusinessTravel"], df["EducationField"]])

BusinessTravel              Non-Travel                                        \
EducationField         Human Resources Life Sciences Marketing Medical Other
Department
Human Resources                      4             1         0       1     0
Research & Development               0            43         0      39     4
Sales                                0            19        12      10     3

BusinessTravel                          Travel_Frequently                \
EducationField         Technical Degree   Human Resources Life Sciences
Department
Human Resources                       0                 6             2
Research & Development               11                 0            91
Sales                                 3                 0            30

BusinessTravel                                                   \
EducationField         Marketing Medical Other Technical Degree
Department
Human Resources                0       2     1                0
Research & Development         0      68    10               13
Sales                         27      16     3                8

BusinessTravel           Travel_Rarely                                        \
EducationField         Human Resources Life Sciences Marketing Medical Other
Department
Human Resources                     17            13         0      10     2
Research & Development               0           306         0     256    50
Sales                                0           101       120      62     9

BusinessTravel
EducationField         Technical Degree
Department
Human Resources                       4
Research & Development               70
Sales                                23

In [41]:
# Example II
pd.crosstab(df["Department"], df["EducationField"], df["MonthlyIncome"], aggfunc="mean")

EducationField,Human Resources,Life Sciences,Marketing,Medical,Other,Technical Degree
Department,,,,,,
Human Resources,7241.148148,6914.062500,NaN,6594.076923,5016.666667,3081.250000
Research & Development,NaN,6179.984091,NaN,6539.223140,6278.687500,5760.819149
Sales,NaN,7246.233333,7348.584906,6377.227273,5398.733333,6066.294118

------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------

## Combinaci√≥n de datos: mezclando dataframes

En el an√°lisis de datos del mundo real, a menudo te encuentras con escenarios donde necesitas combinar datos de diferentes fuentes u organizarlos de manera diferente para realizar un an√°lisis significativo. Pandas proporciona varios m√©todos potentes para fusionar, unir y concatenar DataFrames que te ayudan a gestionar este proceso de manera eficiente.

Para una comprensi√≥n completa de estas t√©cnicas, considera explorar los siguientes recursos:
- [Real Python: Pandas Merge, Join, y Concat](https://realpython.com/pandas-merge-join-and-concat/)
- [Documentaci√≥n de Pandas: Fusi√≥n y Uni√≥n](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)

### Concat: dos cosas juntas
La concatenaci√≥n es una de las operaciones fundamentales para combinar DataFrames. Con `pd.concat()`, puedes unir DataFrames a lo largo de un eje especificado, usualmente a lo largo del eje 0 (verticalmente), para apilarlos uno debajo del otro. Esto alinea las columnas basadas en sus etiquetas, lo que lo convierte en una herramienta valiosa para extender o a√±adir datos verticalmente.

La sintaxis b√°sica para la concatenaci√≥n es la siguiente:
```python
result = pd.concat([df1, df2, ...], axis=0)
```
Aqu√≠, `df1`, `df2`, y as√≠ sucesivamente son los DataFrames que quieres concatenar. El argumento `axis=0` asegura que la concatenaci√≥n ocurra verticalmente, alineando las filas.

Dominando la concatenaci√≥n, puedes gestionar de manera eficiente conjuntos de datos que crecen con el tiempo o combinar datos de varias fuentes en un √∫nico DataFrame cohesivo. Esto es particularmente √∫til cuando se trata de datos de series temporales, archivos de registro u otras situaciones donde los datos se recopilan de manera incremental.

Para profundizar m√°s en la concatenaci√≥n y explorar opciones m√°s avanzadas, puedes referirte a los recursos proporcionados y la documentaci√≥n oficial de Pandas sobre [pd.concat()](https://pandas.pydata.org/docs/reference/api/pandas.concat.html).

In [44]:
# Load some data
df = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user',
                             sep='|', 
                             index_col='user_id')

In [45]:
df.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [46]:
# Let's sample it
first_df = df.sample(frac=0.1)
second_df = df.sample(frac=0.1)

In [47]:
second_df

         age gender     occupation zip_code
user_id
783       30      M      marketing    77081
276       21      M        student    95064
573       68      M        retired    48911
455       48      M  administrator    83709
605       33      M       engineer    33716
...      ...    ...            ...      ...
863       17      M        student    60089
185       53      F      librarian    97403
608       22      M          other    10003
493       22      M       engineer    60090
250       29      M      executive    95110

[94 rows x 4 columns]

In [48]:
second_df.shape

(94, 4)

####¬†Concatenating on axis 0 (rows)

In [50]:
pd.concat([first_df, second_df], axis=0, keys=["Table 1", "Table 2"])

                 age gender     occupation zip_code
        user_id
Table 1 340       46      M       engineer    80123
        702       37      M          other    89104
        326       41      M  administrator    15235
        99        20      M        student    63129
        706       23      M        student    55454
...              ...    ...            ...      ...
Table 2 863       17      M        student    60089
        185       53      F      librarian    97403
        608       22      M          other    10003
        493       22      M       engineer    60090
        250       29      M      executive    95110

[188 rows x 4 columns]

- Esta operaci√≥n concatena los DataFrames `first_df` y `second_df` verticalmente (a lo largo de `axis=0`), lo que significa que los apila uno encima del otro.

- El par√°metro `keys` se utiliza para especificar un √≠ndice jer√°rquico para el DataFrame resultante. En este caso, est√°s dando a cada DataFrame original una etiqueta: "Tabla 1" y "Tabla 2".

- Como resultado, la salida ser√° un nuevo DataFrame con una estructura jer√°rquica (MultiIndex). Puedes pensar en ello como tener dos secciones etiquetadas "Tabla 1" y "Tabla 2", donde cada secci√≥n contiene los datos del respectivo DataFrame original.

####¬†Concatenating on axis 1 (columns)

In [53]:
pd.concat([first_df, second_df], axis=1, keys=["left", "right"])

         left                                right
          age gender     occupation zip_code   age gender occupation zip_code
user_id
340      46.0      M       engineer    80123   NaN    NaN        NaN      NaN
702      37.0      M          other    89104   NaN    NaN        NaN      NaN
326      41.0      M  administrator    15235   NaN    NaN        NaN      NaN
99       20.0      M        student    63129   NaN    NaN        NaN      NaN
706      23.0      M        student    55454   NaN    NaN        NaN      NaN
...       ...    ...            ...      ...   ...    ...        ...      ...
863       NaN    NaN            NaN      NaN  17.0      M    student    60089
185       NaN    NaN            NaN      NaN  53.0      F  librarian    97403
608       NaN    NaN            NaN      NaN  22.0      M      other    10003
493       NaN    NaN            NaN      NaN  22.0      M   engineer    60090
250       NaN    NaN            NaN      NaN  29.0      M  executive    95110

[175 rows x 8 columns]

- Esta operaci√≥n concatena los DataFrames `first_df` y `second_df` horizontalmente (a lo largo de `axis=1`), lo que significa que los combina uno al lado del otro.

- Similar a la primera operaci√≥n, el par√°metro `keys` se utiliza para etiquetar las columnas resultantes de cada DataFrame original. Aqu√≠, las est√°s etiquetando como "izquierda" y "derecha".

- La salida ser√° un nuevo DataFrame donde las columnas est√°n organizadas en dos secciones etiquetadas "izquierda" y "derecha", representando los datos de los respectivos DataFrames originales.

![sql joins](https://upload.wikimedia.org/wikipedia/commons/9/9d/SQL_Joins.svg)

### Merge: related columns

La funci√≥n `merge()` en Pandas es una herramienta poderosa cuando necesitas combinar filas de m√∫ltiples DataFrames basados en columnas relacionadas. Se utiliza principalmente para uniones al estilo de bases de datos donde quieres reunir datos de diferentes fuentes que comparten columnas clave comunes.

**Entendiendo la Funci√≥n `merge()`**:

Puedes pensar en la funci√≥n `merge()` como una manera de fusionar filas que comparten datos a trav√©s de columnas especificadas. Te permite realizar varios tipos de uniones, como uniones internas, externas, izquierdas y derechas, que determinan c√≥mo se combinan las filas de ambos DataFrames.

- **Uni√≥n Interna (Inner Join)**: Este tipo de uni√≥n devuelve solo las filas donde hay una coincidencia en ambos DataFrames basada en las columnas especificadas. Las filas sin coincidencia se excluyen.

- **Uni√≥n Externa (Full Outer Join)**: Una uni√≥n externa devuelve todas las filas cuando hay una coincidencia en cualquiera de los DataFrames izquierdo o derecho. Las filas no emparejadas contendr√°n valores NaN para los datos faltantes.

- **Uni√≥n Izquierda (Left Outer Join)**: Una uni√≥n izquierda devuelve todas las filas del DataFrame izquierdo y las filas emparejadas del DataFrame derecho. Las filas no emparejadas del DataFrame izquierdo a√∫n se incluir√°n.

- **Uni√≥n Derecha (Right Outer Join)**: A la inversa, una uni√≥n derecha devuelve todas las filas del DataFrame derecho y las filas emparejadas del DataFrame izquierdo. Las filas no emparejadas del DataFrame derecho a√∫n se incluir√°n.

**Uso y Sintaxis**:

Aqu√≠ tienes un esquema b√°sico de c√≥mo usar la funci√≥n `merge()`:

```python
merged_df = pd.merge(left_df, right_df, on='common_column', how='join_type')
```
- **Uso y Sintaxis:**

  - `left_df`: El DataFrame izquierdo que quieres fusionar.
  - `right_df`: El DataFrame derecho que quieres fusionar.
  - `on`: La(s) columna(s) en las que quieres realizar la fusi√≥n. Estas columnas deber√≠an existir en ambos DataFrames y servir como la(s) clave(s) para la operaci√≥n de fusi√≥n.
  - `how`: El tipo de uni√≥n que quieres realizar (por ejemplo, 'inner', 'outer', 'left', 'right').

- **Beneficios de Usar `merge()`:**

  - **Integraci√≥n de Datos:** Merge ayuda a integrar datos de m√∫ltiples fuentes o tablas en un conjunto de datos √∫nico y comprensivo.

  - **An√°lisis de Datos:** Simplifica el proceso de combinar informaci√≥n relacionada, facilitando el an√°lisis de datos y la derivaci√≥n de insights.

  - **Operaciones de Base de Datos:** `merge()` se alinea con operaciones comunes de bases de datos como las uniones SQL, permitiendo a los analistas de datos aprovechar su conocimiento de SQL dentro de Pandas.

  - **Consultas Complejas:** Puedes manejar relaciones de datos complejas y realizar consultas que involucren m√∫ltiples tablas de manera eficiente.

Fusionar DataFrames usando `merge()` es una operaci√≥n fundamental en la manipulaci√≥n y an√°lisis de datos, especialmente cuando se trata de conjuntos de datos del mundo real de diversas fuentes. Te proporciona la flexibilidad para controlar c√≥mo se combinan los datos y te permite trabajar con relaciones de datos complejas.

Para obtener informaci√≥n m√°s detallada y opciones, puedes referirte a la documentaci√≥n oficial de Pandas sobre [`merge()`](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.merge.html).

#### LEFT Merge

In [58]:
from IPython.display import display_html

In [59]:
df1 = pd.DataFrame(
    {
        "key1": ["K0", "K0", "K1", "K2"],
        "key2": ["K0", "K1", "K0", "K1"],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
    }
)


df2 = pd.DataFrame(
    {
        "key1": ["K0", "K1", "K1", "K2"],
        "key2": ["K0", "K0", "K0", "K0"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    }
)

df3 = pd.DataFrame(
    {
        "key1": ["K90", "K1", "K1", "K2"],
        "key2": ["K0", "K0", "K5", "K0"],
        "C": ["C0", "C1", "C2", "C3"],
        "Y": ["D0", "D70", "D2", "D5"],
    }
)

In [60]:
# Just showing tables
df1_styler = df1.style.set_table_attributes("style='display:inline'").set_caption('Left table')
df2_styler = df2.style.set_table_attributes("style='display:inline'").set_caption('Right table')
display_html(df1_styler._repr_html_() + " " + df2_styler._repr_html_(), raw=True)

,key1,key2,A,B
0,K0,K0,A0,B0
1,K0,K1,A1,B1
2,K1,K0,A2,B2
3,K2,K1,A3,B3
,key1,key2,C,D
0,K0,K0,C0,D0
1,K1,K0,C1,D1
2,K1,K0,C2,D2
3,K2,K0,C3,D3

In [61]:
#¬†merge, default is inner
pd.merge(df1, df2)

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [62]:
# merges, now is a left
pd.merge(df1, df2, how="left")

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [63]:
# merges, now is a right
pd.merge(df1, df2, how="right")

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [64]:
#¬†merge, now is inner --> default
pd.merge(df1, df2, how="inner")

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [65]:
# merge, now is outer
outer_merge = pd.merge(df1, df2, how="outer")
outer_merge

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K0  NaN  NaN   C3   D3
5   K2   K1   A3   B3  NaN  NaN

###¬†Merging & Concatenating in two different columns

In [67]:
df1_docs = pd.DataFrame({'Locations': ['Spain', 'France', 'Portugal', 'Spain'],
                    'city': ["Barcelona", "Paris", "Lisbon", "Madrid"]})
df2_docs = pd.DataFrame({'More locations': ['Spain', 'France', 'Portugal', 'Spain'],
                    'city': ["Madrid", "Lyon", "Porto", "Albacete"]})

####¬†Concatenating in two different columns

In [69]:
pd.concat([df1_docs, df2_docs], axis=1, keys=["1st table", "2nd table"])

  1st table                 2nd table
  Locations       city More locations      city
0     Spain  Barcelona          Spain    Madrid
1    France      Paris         France      Lyon
2  Portugal     Lisbon       Portugal     Porto
3     Spain     Madrid          Spain  Albacete

####¬†Merging in two different columns

In [71]:
df1_docs.merge(df2_docs, left_on='Locations', right_on='More locations', suffixes = ["_fromlastyear", "_fromthisyear"])

  Locations city_fromlastyear More locations city_fromthisyear
0     Spain         Barcelona          Spain            Madrid
1     Spain         Barcelona          Spain          Albacete
2    France             Paris         France              Lyon
3  Portugal            Lisbon       Portugal             Porto
4     Spain            Madrid          Spain            Madrid
5     Spain            Madrid          Spain          Albacete

In [72]:
df1_docs.merge(df2_docs,  left_on='Locations', right_on='More locations', suffixes = ["_fromleft", "_fromright"])

  Locations city_fromleft More locations city_fromright
0     Spain     Barcelona          Spain         Madrid
1     Spain     Barcelona          Spain       Albacete
2    France         Paris         France           Lyon
3  Portugal        Lisbon       Portugal          Porto
4     Spain        Madrid          Spain         Madrid
5     Spain        Madrid          Spain       Albacete

### Join: relating index
The join, unlike the merge, will join the dataframes and where there are no records in the "index" it will put NaN

In [74]:
import numpy as np
import pandas as pd   
from IPython.display import display_html

In [75]:
left_df = pd.DataFrame({"A": ["A0", "A1", "A2"], "B": ["B0", "B1", "B2"]}, index=["K0", "K1", "K2"])
right_df = pd.DataFrame({"C": ["C0", "C2", "C3"], "D": ["D0", "D2", "D3"]}, index=["K0", "K2", "K3"])

In [76]:
left_df.join(right_df, how="inner")

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

### Diferencias entre join y merge
Al combinar DataFrames en Pandas, tienes dos m√©todos principales a tu disposici√≥n: `join()` y `merge()`. Cada m√©todo tiene su propio conjunto de caracter√≠sticas y casos de uso. A continuaci√≥n, se presenta una comparaci√≥n de estos dos m√©todos basada en diferentes caracter√≠sticas de uni√≥n:

| Caracter√≠stica de Uni√≥n             | `join()` | `merge()` |
|-------------------------------------|:--------:|:---------:|
| Uni√≥n Interna (Inner Join)          |   S√≠     |    S√≠     |
| Uni√≥n Izquierda (Left Join)         |   S√≠     |    S√≠     |
| Uni√≥n Derecha (Right Join)          |   S√≠     |    S√≠     |
| Uni√≥n Externa (Outer Join)          |   S√≠     |    S√≠     |
| Uni√≥n Cruzada (Cross Join)          |    X     |    S√≠     |
| Uni√≥n en √çndices                    |   S√≠     |    S√≠     |
| Uni√≥n en Columnas                   |    X     |    S√≠     |
| Izquierda en Columna, Derecha en √çndice |   S√≠  |    S√≠     |
| Izquierda en √çndice, Derecha en Columna |    X  |    S√≠     |

**Explicaci√≥n:**

- **Uni√≥n Interna (Inner Join):** Tanto `join()` como `merge()` admiten uniones internas, que devuelven solo las filas con valores coincidentes en ambos DataFrames.

- **Uni√≥n Izquierda (Left Join):** Ambos m√©todos permiten uniones izquierdas, que incluyen todas las filas del DataFrame izquierdo y las filas coincidentes del DataFrame derecho.

- **Uni√≥n Derecha (Right Join):** Ambos m√©todos admiten uniones derechas, que incluyen todas las filas del DataFrame derecho y las filas coincidentes del DataFrame izquierdo.

- **Uni√≥n Externa (Outer Join):** Ambos m√©todos permiten uniones externas, que incluyen todas las filas de ambos DataFrames, rellenando los valores faltantes con NaN donde sea necesario.

- **Uni√≥n Cruzada (Cross Join):** Mientras que `merge()` puede realizar uniones cruzadas, `join()` no las admite. Las uniones cruzadas resultan en un producto cartesiano de filas entre dos DataFrames.

- **Uni√≥n en √çndices:** Tanto `join()` como `merge()` pueden realizar uniones basadas en el √≠ndice de los DataFrames.

- **Uni√≥n en Columnas:** `merge()` permite unir DataFrames en columnas espec√≠ficas, mientras que `join()` no ofrece esta capacidad.

- **Izquierda en Columna, Derecha en √çndice:** Ambos m√©todos admiten la uni√≥n en una columna del DataFrame izquierdo y el √≠ndice del DataFrame derecho.

- **Izquierda en √çndice, Derecha en Columna:** `merge()` puede unir en el √≠ndice del DataFrame izquierdo y una columna del DataFrame derecho, pero `join()` no ofrece esta opci√≥n.

Esta comparaci√≥n deber√≠a ayudarte a elegir el m√©todo apropiado basado en tus requisitos espec√≠ficos de fusi√≥n.

## Business challenge: IronHack Delivery orders analysis (use pycharm)

En este an√°lisis, exploraremos un conjunto de datos que contiene informaci√≥n sobre pedidos de socios falsos dentro de la aplicaci√≥n. Los socios falsos son tiendas no integradas directamente con Glovo, y nuestro equipo de contenido gestiona su cat√°logo de productos y precios. Este conjunto de datos proporciona detalles sobre los pedidos, discrepancias de pago y otra informaci√≥n relevante.

1. Descripci√≥n del Conjunto de Datos
    - `order_id`: Identificador √∫nico para cada pedido.
    - `activation_time_local`: Hora local cuando se activ√≥ el pedido.
    - `country_code`: C√≥digo de pa√≠s para el pedido.
    - `store_address`: Direcci√≥n de la tienda.
    - `final_status`: El estado final del pedido.
    - `payment_status`: El estado de pago del pedido.
    - `products`: N√∫mero de productos en el pedido.
    - `products_total`: Monto total en el momento de la compra en euros (‚Ç¨).
    - `purchase_total_price`: Monto que el mensajero pag√≥ en la tienda en euros (‚Ç¨).

2. Antecedentes
Los pedidos de socios falsos pueden exhibir discrepancias entre el monto total en el momento de la compra (`products_total`) y el monto que el mensajero paga en la tienda (`purchase_total_price`). Cuando `products_total` es menor que `purchase_total_price`, los clasificamos como "pedidos no autorizados suficientemente". Entender estas discrepancias es crucial para la transici√≥n de cobro contra entrega a un modelo de autorizaci√≥n y captura.

3. Preguntas Clave
Durante este proceso de An√°lisis Exploratorio de Datos (EDA), apuntamos a responder las siguientes preguntas:

    1. ¬øQu√© porcentaje de pedidos no est√°n suficientemente autorizados?
    2. ¬øQu√© porcentaje de pedidos estar√≠an correctamente autorizados con una autorizaci√≥n incremental del 20% sobre el monto en el momento de la compra?
    3. ¬øExisten diferencias en los porcentajes anteriores cuando se dividen por pa√≠s?
    4. Para los pedidos restantes fuera de la autorizaci√≥n incremental, ¬øqu√© valores ser√≠an necesarios para capturar el monto restante?
    5. ¬øCu√°les son las tiendas m√°s problem√°ticas en t√©rminos de pedidos y valor monetario?
    6. Para los pedidos no autorizados suficientemente, ¬øexiste una correlaci√≥n entre la diferencia de precio y las cancelaciones de pedidos? En otras palabras, ¬øes m√°s probable que un pedido sea cancelado a medida que aumenta la diferencia de precio?

A trav√©s de este an√°lisis, apuntamos a obtener insights sobre las fluctuaciones de precios de pedidos pasados y evaluar el riesgo asociado con la transici√≥n a un nuevo modelo de autorizaci√≥n.

¬°Sum√©rgete en el conjunto de datos y comienza a explorar!

In [79]:
# A

In [80]:
df = pd.read_csv("./datasets/fake_orders_test.csv")

In [81]:
df.head()

,33557880,2019-03-10 23:59:59.000000,AR,14200,DeliveredStatus,PAID,1,4.54,8.64
0,33512615,2019-03-10 23:58:32.000000,TR,28725,DeliveredStatus,PAID,1,3.76,3.76
1,33512451,2019-03-10 23:57:56.000000,TR,28725,DeliveredStatus,PAID,1,2.86,2.86
2,33530892,2019-03-10 23:57:33.000000,ES,19777,CanceledStatus,PAID,1,12.95,0.00
3,33557765,2019-03-10 23:57:21.000000,AR,34565,DeliveredStatus,PAID,2,2.86,6.48
4,33512273,2019-03-10 23:57:13.000000,TR,63536,DeliveredStatus,PAID,4,1.88,1.96

In [82]:
new_df = df.copy()

In [83]:
new_df.columns = ['order_id', 'activation_time_local', 'country_code', 'store_address', 'final_status', 'payment_status', 'products', 'products_total', 'purchase_total_price']

In [84]:
new_df['No_Autorizados'] = new_df['products_total'] > new_df['purchase_total_price']

In [85]:
new_df.head()

,order_id,activation_time_local,country_code,store_address,final_status,payment_status,products,products_total,purchase_total_price,No_Autorizados
0,33512615,2019-03-10 23:58:32.000000,TR,28725,DeliveredStatus,PAID,1,3.76,3.76,False
1,33512451,2019-03-10 23:57:56.000000,TR,28725,DeliveredStatus,PAID,1,2.86,2.86,False
2,33530892,2019-03-10 23:57:33.000000,ES,19777,CanceledStatus,PAID,1,12.95,0.00,True
3,33557765,2019-03-10 23:57:21.000000,AR,34565,DeliveredStatus,PAID,2,2.86,6.48,False
4,33512273,2019-03-10 23:57:13.000000,TR,63536,DeliveredStatus,PAID,4,1.88,1.96,False

In [86]:
new_df['No_Autorizados'].value_counts()

No_Autorizados
False    47134
True     13265
Name: count, dtype: int64

In [87]:
new_df['final_status'].value_counts()

final_status
DeliveredStatus    53902
CanceledStatus      6497
Name: count, dtype: int64

In [88]:
filt_df = new_df[new_df['final_status'] != 'CanceledStatus']
filt_df.head()

,order_id,activation_time_local,country_code,store_address,final_status,payment_status,products,products_total,purchase_total_price,No_Autorizados
0,33512615,2019-03-10 23:58:32.000000,TR,28725,DeliveredStatus,PAID,1,3.76,3.76,False
1,33512451,2019-03-10 23:57:56.000000,TR,28725,DeliveredStatus,PAID,1,2.86,2.86,False
3,33557765,2019-03-10 23:57:21.000000,AR,34565,DeliveredStatus,PAID,2,2.86,6.48,False
4,33512273,2019-03-10 23:57:13.000000,TR,63536,DeliveredStatus,PAID,4,1.88,1.96,False
5,33524023,2019-03-10 23:57:06.000000,EG,73739,DeliveredStatus,PAID,3,10.19,1.61,True

In [89]:
filt_df['No_Autorizados'].value_counts()

No_Autorizados
False    46690
True      7212
Name: count, dtype: int64

In [90]:
no_aut_true = filt_df['No_Autorizados'].sum() # s√≥lo suma los True!!!
no_aut_total = len(filt_df['No_Autorizados'])
no_aut_false = no_aut_total - no_aut_true

In [91]:
print(f'Trues: {no_aut_true}')
print(f'Falses: {no_aut_false}')
print(f'Total: {no_aut_total}')

porcentaje = no_aut_true/no_aut_total*100

Trues: 7212
Falses: 46690
Total: 53902

In [92]:
print(f'El porcentaje de ventas no autorizadas es de: {porcentaje:.2f}%')

El porcentaje de ventas no autorizadas es de: 13.38%

In [93]:
# B

In [163]:
new_df.head()

,order_id,activation_time_local,country_code,store_address,final_status,payment_status,products,products_total,purchase_total_price,No_Autorizados
0,33512615,2019-03-10 23:58:32.000000,TR,28725,DeliveredStatus,PAID,1,3.76,3.76,False
1,33512451,2019-03-10 23:57:56.000000,TR,28725,DeliveredStatus,PAID,1,2.86,2.86,False
2,33530892,2019-03-10 23:57:33.000000,ES,19777,CanceledStatus,PAID,1,12.95,0.00,True
3,33557765,2019-03-10 23:57:21.000000,AR,34565,DeliveredStatus,PAID,2,2.86,6.48,False
4,33512273,2019-03-10 23:57:13.000000,TR,63536,DeliveredStatus,PAID,4,1.88,1.96,False

#¬†RECAP

## Subconjuntos
- Seleccionar columnas espec√≠ficas:
  - `df[[col1, col2]]`

## Agreggations
### Groupby
- Realizar agregaciones basadas en una columna categ√≥rica:
  - `df[[col1, col2]].groupby(CATEGORICAL).agg({QUANTITATIVE_1: "mean", QUANTITATIVE_2: "max"})`
  - `df[[col1, col2]].groupby(CATEGORICAL).mean()`
- Funciones de agregaci√≥n comunes:
  - count (conteo), mean (media), max (m√°ximo), min (m√≠nimo), median (mediana), std (desviaci√≥n est√°ndar), y m√°s.

### Pivot table
- Crear tablas pivote para resumir datos:
  - `df.pivot_table(values="MonthlyIncome", index="Department", aggfunc="mean")`
- Las tablas pivote ofrecen una forma concisa de agregar y comparar datos.

### Crosstab
- Calcular tabulaciones cruzadas para analizar la relaci√≥n entre dos variables categ√≥ricas:
  - El comportamiento predeterminado cuenta ocurrencias.
  - Usa `aggfunc="mean"` para agregar variables cuantitativas.
  - Aseg√∫rate de seleccionar variables apropiadas.

## UNION & MERGE & CONCAT

### Concatenaci√≥n
- Combinar DataFrames f√≠sicamente (no relacionalmente):
  - Lado a lado: `concat` en `axis=1`.
    - Usar cuando los DataFrames no comparten columnas o tienen una clave com√∫n.
  - Arriba & abajo: `concat` en `axis=0` (a√±adiendo filas).
    - Adecuado cuando los DataFrames comparten columnas.

### Merge & Join (Pandas)
- Merge: Combinar DataFrames basados en columnas comunes.
- Join: Combinar DataFrames basados en √≠ndices comunes.
- En SQL, las operaciones de uni√≥n se realizan sobre columnas.

Estos puntos de recapitulaci√≥n resumen operaciones clave para la manipulaci√≥n y an√°lisis de datos en Pandas. Puedes usar estas t√©cnicas para seleccionar, agregar y combinar datos de manera eficiente, ayud√°ndote a obtener insights de tus conjuntos de datos.

## Metodos usuales de pandas
```python
df.head() # prints the head, default 5 rows
df.tail() # set the tail, default 5 rows
df.describe() # statistical description
df.info() # df information
df.columns # show column
df.index # show index
df.dtypes # show column data types
df.plot() # make a plot
df.hist() # make a histogram
df.col.value_counts() # counts the unique values ‚Äã‚Äãof a column
df.col.unique() # returns unique values ‚Äã‚Äãfrom a column
df.copy() # copies the df
df.drop() # remove columns or rows (axis=0,1)
df.dropna() # remove nulls
df.fillna() # fills nulls
df.shape # dimensions of the df
df._get_numeric_data() # select numeric columns
df.rename() # rename columns
df.str.replace() # replace columns of strings
df.astype(dtype='float32') # change the data type
df.iloc[] # locate by index
df.loc[] # locate by element
df.transpose() # transposes the df
df.T
df.sample(n, frac) # sample from df
df.col.sum() # sum of a column
df.col.max() # maximum of a column
df.col.min() # minimum of one column
df[col] # select column
df.col
df.isnull() # null values
df.isna()
df.notna() # not null values
df.drop_duplicates() # remove duplicates
df.reset_index(inplace=True) # reset the index and overwrite
```

## M√°s material

* [Read the docs!](https://pandas.pydata.org/pandas-docs/stable/index.html)
* [Cheatsheet](https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf)
* [Exercises to practice](https://github.com/guipsamora/pandas_exercises)
* [More on merge, concat, and join](https://realpython.com/pandas-merge-join-and-concat/#pandas-join-combining-data-on-a-column-or-index). And [even more!](https://pandas.pydata.org/pandas-docs/stable/user_guide/merging.html)